applications/test/foamTestIsoSurface/isoSurfaceTestCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (dispersed continuous);

    dispersed
    {
        transportModel  Newtonian;
        nu              1.0e-06;
        rho             1000.0;
    }

    continuous
    {
        transportModel  Newtonian;
        nu              1.48e-05;
        rho             1.0;
    }

    sigma               72.75e-3;



// ************************************************************************* //
